import {N4way} from "../common/Types";
export namespace HashiBaseConstants{
    /**
     * 方向を指定するとその方向に1マスずらしたときのx座標変化を返す
     */
    export const dirX:N4way = [-1,0,1,0];
    /**
     * 方向を指定するとその方向に1マスずらしたときのy座標変化を返す
     */
    export const dirY:N4way = [0,1,0,-1];
    export const default4way = {
        all0:[0,0,0,0] as N4way,
        all1:[1,1,1,1] as N4way,
        plus1:[[1,0,0,0],[0,1,0,0],[0,0,1,0],[0,0,0,1]] as [N4way,N4way,N4way,N4way],
        minus1:[[-1,0,0,0],[0,-1,0,0],[0,0,-1,0],[0,0,0,-1]] as [N4way,N4way,N4way,N4way],
        one0:[[0,1,1,1],[1,0,1,1],[1,1,0,1],[1,1,1,0]] as [N4way,N4way,N4way,N4way],
    };
    export const resultCode ={
        /**変化なし */
        rc000:"000",
        rc00011:"00011",
        rc00012:"00012",
        rc00013:"00013",
        rc00014:"00014",
        rc00015:"00015",
        rc00016:"00016",
        rc00017:"00017",
        rc00018:"00018",
        rc00019:"00019",
        rc000110:"000110",
        rc000111:"000111",
        rc00021:"00021",
        rc00022:"00022",
        rc00023:"00023",
        rc00024:"00024",
        rc00025:"00025",
        rc00026:"00026",
        rc00027:"00027",
        rc00028:"00028",
        rc00029:"00029",
        rc00031:"00031",
        rc00032:"00032",
        rc00033:"00033",
        rc00034:"00034",
        rc00035:"00035",
        rc00036:"00036",
        rc00041:"00041",
        rc00042:"00042",
        rc00043:"00043",
        rc00044:"00044",
        rc00045:"00045",
        rc00046:"00046",
        rc00051:"00051",
        rc00052:"00052",
        rc00053:"00053",
        rc00061:"00061",
        /**URL取り込み */
        rcI00:"I00",
    } as const
}

